RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_memslot.c
        if (device->octalEnableRegAddr != CY_SMIF_NO_COMMAND_OR_MODE)
        {
            result = ReadAnyReg(base, memDevice->slaveSelect, &octalEnableAddr[4],
                                    readOeCmd, 0, (uint8_t *)&device->octalEnableRegAddr,
                                    4, context);

            if (CY_SMIF_SUCCESS == result)
            {
                uint32_t oeMask = device->stsRegOctalEnableMask;

                octalEnableAddr[4] |= (uint8_t)oeMask;

                /* The Write Enable */
                result =  Cy_SMIF_MemCmdWriteEnable(base, memDevice, context);

                /* The Write Status */
                if (CY_SMIF_SUCCESS == result)
                {
                    octalEnableAddr[3] = (uint8_t) device->octalEnableRegAddr; /* only 8 bits are valid as per SFDP spec */

                    result = Cy_SMIF_TransmitCommand( base, writeOeCmd, CY_SMIF_WIDTH_SINGLE,
                                (uint8_t const *)octalEnableAddr, 5, CY_SMIF_WIDTH_SINGLE,
                                memDevice->slaveSelect, CY_SMIF_TX_LAST_BYTE, context);
                }
            }
        }
        else
        {
            uint8_t statusReg = 0;
            result = Cy_SMIF_MemCmdReadStatus(base, memDevice, &statusReg,
                        readOeCmd, context);
            if (CY_SMIF_SUCCESS == result)
            {
                uint32_t oeMask = device->stsRegOctalEnableMask;

                statusReg |= (uint8_t)oeMask;
                result = Cy_SMIF_MemCmdWriteStatus(base, memDevice,
                             &statusReg, writeOeCmd, context);
            }
        }
    }

    return(result);
}
#endif
#if (CY_IP_MXSMIF_VERSION>=2)
static cy_en_smif_status_t cy_smif_octalddrenable(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result= CY_SMIF_CMD_NOT_FOUND;
    cy_stc_smif_mem_device_cfg_t* device =  memDevice->deviceCfg;
    cy_stc_smif_octal_ddr_en_seq_t* oDDREnSeq = device->octalDDREnableSeq;

    /* Check that command exists */
    if ((oDDREnSeq != NULL) && (base != NULL) && (context != NULL))
    {
        /* Send Command Sequence 1 */
        if (oDDREnSeq->cmdSeq1Len > 0U)
        {
            result = Cy_SMIF_TransmitCommand( base, oDDREnSeq->cmdSeq1[0], CY_SMIF_WIDTH_SINGLE,
                        (uint8_t const *)&oDDREnSeq->cmdSeq1[1U],
                        ((uint32_t)oDDREnSeq->cmdSeq1Len - 1U), CY_SMIF_WIDTH_SINGLE,
                        memDevice->slaveSelect, CY_SMIF_TX_LAST_BYTE, context);
        }
        /* Send Command Sequence 2 */
        if (oDDREnSeq->cmdSeq2Len > 0U)
        {
            result = Cy_SMIF_TransmitCommand( base, oDDREnSeq->cmdSeq2[0], CY_SMIF_WIDTH_SINGLE,
                        (uint8_t const *)&oDDREnSeq->cmdSeq2[1U],
                        ((uint32_t)oDDREnSeq->cmdSeq2Len - 1U), CY_SMIF_WIDTH_SINGLE,
                        memDevice->slaveSelect, CY_SMIF_TX_LAST_BYTE, context);
        }

#if (CY_IP_MXSMIF_VERSION>=5)
        /* Set the clock to xSPI mode */
        Cy_SMIF_SetRxCaptureMode(base, CY_SMIF_SEL_XSPI_HYPERBUS_WITH_DQS);
#endif

        /* Change Write Enable to 16-bit Octal DDR */
        device->writeEnCmd->commandH = CY_SMIF_WRITE_ENABLE_CMD;
        device->writeEnCmd->cmdRate = CY_SMIF_DDR;
        device->writeEnCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->writeEnCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;

        /* Change Write Disable to 16-bit Octal DDR*/
        device->writeDisCmd->commandH = CY_SMIF_WRITE_ENABLE_CMD;
        device->writeDisCmd->cmdRate = CY_SMIF_DDR;
        device->writeDisCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->writeDisCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;

        /* Change Read WIP status register to 16-bit Octal DDR */
        device->readStsRegWipCmd->commandH = CY_SMIF_READ_STATUS_REG1_CMD;
        device->readStsRegWipCmd->cmdRate = CY_SMIF_DDR;
        device->readStsRegWipCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->readStsRegWipCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;
        device->readStsRegWipCmd->addrRate = CY_SMIF_DDR;
        device->readStsRegWipCmd->addrWidth = CY_SMIF_WIDTH_OCTAL;
        device->readStsRegWipCmd->dummyCycles= 3;
        device->readStsRegWipCmd->dummyCyclesPresence = CY_SMIF_PRESENT_2BYTE;

        /* Change Chip Erase command to 16-bit Octal DDR */
        device->chipEraseCmd->commandH = CY_SMIF_CHIP_ERASE_CMD;
        device->chipEraseCmd->cmdRate = CY_SMIF_DDR;
        device->chipEraseCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->chipEraseCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;

        /* Change Chip Erase command to 16-bit Octal DDR */
        device->eraseCmd->commandH = CY_SMIF_CHIP_ERASE_CMD;
        device->eraseCmd->cmdRate = CY_SMIF_DDR;
        device->eraseCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->eraseCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;
        device->eraseCmd->addrRate = CY_SMIF_DDR;
        device->eraseCmd->addrWidth = CY_SMIF_WIDTH_OCTAL;

        /* Change Program command to 16-bit Octal DDR */
        device->programCmd->commandH = device->programCmd->command;
        device->programCmd->cmdRate = CY_SMIF_DDR;
        device->programCmd->cmdWidth = CY_SMIF_WIDTH_OCTAL;
        device->programCmd->cmdPresence = CY_SMIF_PRESENT_2BYTE;
        device->programCmd->addrRate = CY_SMIF_DDR;
        device->programCmd->addrWidth = CY_SMIF_WIDTH_OCTAL;
        device->programCmd->dataRate = CY_SMIF_DDR;
        device->programCmd->dataWidth = CY_SMIF_WIDTH_OCTAL;
    }
    return(result);
}
#endif
/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdReadStatus
****************************************************************************//**
*
* This function reads the status register. This function is a blocking function,
* it will block the execution flow until the status register is read.
*
* \note This function uses the low-level Cy_SMIF_TransmitCommand() API.
* the Cy_SMIF_TransmitCommand() API works in a blocking mode. In the dual quad mode,
* this API is called for each memory.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param status
* The status register value returned by the external memory.
*
* \param command
* The command required to read the status/configuration register.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of the command reception.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*
* \note Check \ref group_smif_usage_rules for any usage restriction 
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdReadStatus(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    uint8_t *status,
                                    uint8_t command,
                                    cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t result = CY_SMIF_CMD_NOT_FOUND;

    /* Read the memory status register */
    result = Cy_SMIF_TransmitCommand( base, command, CY_SMIF_WIDTH_SINGLE,
                NULL, CY_SMIF_CMD_WITHOUT_PARAM,
                CY_SMIF_WIDTH_NA, memDevice->slaveSelect, 
                CY_SMIF_TX_NOT_LAST_BYTE, context);

