RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_memslot.c
    CY_ASSERT_L1(NULL != memDevice);

    if (NULL != sectorAddr)
    {
        cy_stc_smif_mem_device_cfg_t *device = memDevice->deviceCfg;
        cy_stc_smif_mem_cmd_t *cmdErase = device->eraseCmd;
        cy_stc_smif_hybrid_region_info_t* hybrInfo = NULL;

        result = Cy_SMIF_MemLocateHybridRegion(memDevice, &hybrInfo,
                ByteArrayToValue(sectorAddr, device->numOfAddrBytes));

        if ((NULL != cmdErase) && (CY_SMIF_WIDTH_NA != cmdErase->cmdWidth) && (result != CY_SMIF_BAD_PARAM))
        {
            uint16_t eraseCommand = (uint16_t)((result == CY_SMIF_SUCCESS) ? (hybrInfo->eraseCmd) : (cmdErase->command));
#if (CY_IP_MXSMIF_VERSION>=2)
            if (device->eraseCmd->cmdWidth != CY_SMIF_WIDTH_OCTAL)
            {
#endif
                result = Cy_SMIF_TransmitCommand( base, (uint8_t)eraseCommand,
                        cmdErase->cmdWidth, sectorAddr, device->numOfAddrBytes,
                        cmdErase->cmdWidth, memDevice->slaveSelect,
                        CY_SMIF_TX_LAST_BYTE, context);

#if (CY_IP_MXSMIF_VERSION>=2)
            }
            else
            {
                result = Cy_SMIF_TransmitCommand_Ext( base, (eraseCommand | ((uint16_t)eraseCommand << 8)),
                    true,cmdErase->cmdWidth, cmdErase->cmdRate, sectorAddr, device->numOfAddrBytes,
                    cmdErase->cmdWidth, cmdErase->addrRate, memDevice->slaveSelect,
                    CY_SMIF_TX_LAST_BYTE, context);

            }
#endif
        }
        else
        {
            result = CY_SMIF_CMD_NOT_FOUND;
        }
    }
    return(result);
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemCmdProgram
****************************************************************************//**
*
* This function performs the Program operation. 
*
* \note This function uses the  Cy_SMIF_TransmitCommand() API.
* The Cy_SMIF_TransmitCommand() API works in the blocking mode. In the dual quad mode,
* this API works with both types of memory simultaneously.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memDevice
* The device to which the command is sent.
*
* \param addr
* The address to program.
*
* \param writeBuff
* The pointer to the data to program. If this pointer is a NULL, then the
* function does not enable the interrupt. This use case is  typically used when
* the FIFO is handled outside the interrupt and is managed in either a 
* polling-based code or a DMA. The user would handle the FIFO management 
* in a DMA or a polling-based code. 
* If the user provides a NULL pointer in this function and does not handle 
* the FIFO transaction, this could either stall or timeout the operation 
* \ref Cy_SMIF_TransmitData().
*
* \param size
* The size of data to program. The user must ensure that the data size
* does not exceed the page size.
*
* \param cmdCompleteCb
* The callback function to call after the transfer completion. NULL interpreted
* as no callback.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return A status of a transmission.
*       - \ref CY_SMIF_SUCCESS
*       - \ref CY_SMIF_CMD_FIFO_FULL
*       - \ref CY_SMIF_BAD_PARAM
*       - \ref CY_SMIF_EXCEED_TIMEOUT
*       - \ref CY_SMIF_CMD_NOT_FOUND
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemCmdProgram(SMIF_Type *base,
                                    cy_stc_smif_mem_config_t const *memDevice,
                                    uint8_t const *addr,
                                    uint8_t const *writeBuff,
                                    uint32_t size,
                                    cy_smif_event_cb_t cmdCompleteCb,
                                    cy_stc_smif_context_t *context)
{
    cy_en_smif_status_t result = CY_SMIF_SUCCESS;
    cy_en_smif_slave_select_t slaveSelected;

    cy_stc_smif_mem_device_cfg_t *device = memDevice->deviceCfg;
    cy_stc_smif_mem_cmd_t *cmdProg = device->programCmd;
    
    if(NULL == cmdProg)
    {
        result = CY_SMIF_CMD_NOT_FOUND;
    }
    else if ((NULL == addr) || (size > device->programSize))
    {
        result = CY_SMIF_BAD_PARAM;
    }
    else
    {
        slaveSelected = (0U == memDevice->dualQuadSlots)?  memDevice->slaveSelect :
                                                        (cy_en_smif_slave_select_t)memDevice->dualQuadSlots;

#if (CY_IP_MXSMIF_VERSION>=2)
        if(cmdProg->cmdWidth == CY_SMIF_WIDTH_OCTAL)
        {
            /* The page program command */
            result = Cy_SMIF_TransmitCommand_Ext( base, (uint16_t)(cmdProg->command | cmdProg->command << 8),
                    true,
                    cmdProg->cmdWidth, cmdProg->cmdRate,
                    addr, device->numOfAddrBytes,
                    cmdProg->addrWidth, cmdProg->addrRate, slaveSelected, CY_SMIF_TX_NOT_LAST_BYTE,
                    context);

            if((CY_SMIF_SUCCESS == result) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdProg->mode))
            {
                result = Cy_SMIF_TransmitCommand(base, (uint8_t)cmdProg->mode,
                            cmdProg->modeWidth, NULL,
                            CY_SMIF_CMD_WITHOUT_PARAM, CY_SMIF_WIDTH_NA,
                            (cy_en_smif_slave_select_t)slaveSelected,
                            CY_SMIF_TX_NOT_LAST_BYTE, context);
            }

            if((CY_SMIF_SUCCESS == result) && (cmdProg->dummyCycles > 0U))
            {
                result = Cy_SMIF_SendDummyCycles_Ext(base, CY_SMIF_WIDTH_OCTAL, cmdProg->addrRate, cmdProg->dummyCycles);
            }

            if(CY_SMIF_SUCCESS == result)
            {
                result = Cy_SMIF_TransmitData_Ext( base, writeBuff, size,
                        cmdProg->dataWidth, cmdProg->dataRate, cmdCompleteCb, context);
            }

