RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_memslot.c
    *isQuadEnabled = false;
    if(CY_SMIF_SUCCESS == status)
    {
        /* Check whether quad mode is already enabled or not */
        *isQuadEnabled = (maskQE == (readStatus & maskQE));
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemEnableQuadMode
****************************************************************************//**
*
* Sets the QE (QUAD Enable) bit in the external memory
* configuration register to enable quad SPI mode.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param timeoutUs
*  The timeout value in microseconds to apply while polling the memory. 
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \funcusage 
* See \ref Cy_SMIF_MemIsQuadEnabled usage.
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemEnableQuadMode(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig, 
                                              uint32_t timeoutUs, cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status;

    CY_ASSERT_L1(NULL !=  memConfig);

    /* Send Write Enable to the external memory */
    status = Cy_SMIF_MemCmdWriteEnable(base, (cy_stc_smif_mem_config_t* )memConfig, context);

    if(CY_SMIF_SUCCESS == status)
    {
        status = Cy_SMIF_MemQuadEnable(base, (cy_stc_smif_mem_config_t* )memConfig, context);

        if(CY_SMIF_SUCCESS == status)
        {
            /* Poll the memory for the completion of the operation */
            status = Cy_SMIF_MemIsReady(base, memConfig, timeoutUs, context);
        }
    }

    return status;
}

/*******************************************************************************
* Function Name: Cy_SMIF_MemRead
****************************************************************************//**
*
* Reads data from the external memory and blocks until the read
* transfer is complete or a timeout occurs.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param address
* The address to read data from.
*
* \param rxBuffer
* The buffer for storing the read data.
*
* \param length
* The size of data to read.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \funcusage 
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemRead
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemRead(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig, 
                                    uint32_t address, uint8_t rxBuffer[], 
                                    uint32_t length, cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status = CY_SMIF_BAD_PARAM;
    uint32_t chunk = 0UL;
    uint8_t addrArray[CY_SMIF_FOUR_BYTES_ADDR] = {0U};
    cy_stc_smif_mem_cmd_t *cmdRead;

    CY_ASSERT_L1(NULL != memConfig);
    CY_ASSERT_L1(NULL != rxBuffer);

    cmdRead = memConfig->deviceCfg->readCmd;

    if((address + length) <= memConfig->deviceCfg->memSize)  /* Check if the address exceeds the memory size */
    {
        uint32_t interruptState = 0;

        /* If XIP is enabled, disable interrupts to avoid task switching to XIP location */
        if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
        {
            interruptState = Cy_SysLib_EnterCriticalSection();
        }

        /* SMIF can read only up to 65536 bytes in one go. Split the larger read into multiple chunks */
        while (length > 0UL)
        {
            /* Get the number of bytes which can be read during one operation */
            chunk = (length > SMIF_MAX_RX_COUNT) ? (SMIF_MAX_RX_COUNT) : length;
            ValueToByteArray(address, &addrArray[0], 0UL,
                             memConfig->deviceCfg->numOfAddrBytes);

#if (CY_IP_MXSMIF_VERSION>=2)
            status = Cy_SMIF_TransmitCommand_Ext(base,
                                             (uint16_t)(cmdRead->command | cmdRead->commandH << 8),
                                             ((bool)cmdRead->commandH),
                                             cmdRead->cmdWidth,
                                             cmdRead->cmdRate,
                                             (const uint8_t *)addrArray,
                                             memConfig->deviceCfg->numOfAddrBytes,
                                             cmdRead->addrWidth,
                                             cmdRead->addrRate,
                                             memConfig->slaveSelect,
                                             CY_SMIF_TX_NOT_LAST_BYTE,
                                             context);

            if((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdRead->mode))
            {
                status = Cy_SMIF_TransmitCommand_Ext(base,
                                                 (uint16_t)cmdRead->mode,
                                                 false,
                                                 cmdRead->modeWidth,
                                                 cmdRead->modeRate,
                                                 NULL,
                                                 CY_SMIF_CMD_WITHOUT_PARAM,
                                                 CY_SMIF_WIDTH_NA,
                                                 cmdRead->modeRate,
                                                 memConfig->slaveSelect,
                                                 CY_SMIF_TX_NOT_LAST_BYTE,
                                                 context);
            }

            if((CY_SMIF_SUCCESS == status) && (0U < cmdRead->dummyCycles))
            {
                status = Cy_SMIF_SendDummyCycles_Ext(base, cmdRead->dataWidth, cmdRead->dataRate, cmdRead->dummyCycles);
            }

            if(CY_SMIF_SUCCESS == status)
            {
                 status = Cy_SMIF_ReceiveDataBlocking_Ext(base,
                                            rxBuffer,
                                            chunk,
                                            cmdRead->dataWidth,
                                            cmdRead->dataRate,
                                            context);
            }
#else
            status = Cy_SMIF_TransmitCommand(base,
                                                (uint8_t)cmdRead->command,
                                                cmdRead->cmdWidth,
                                                (const uint8_t *)addrArray,
                                                memConfig->deviceCfg->numOfAddrBytes,
                                                cmdRead->addrWidth,
                                                memConfig->slaveSelect,
                                                CY_SMIF_TX_NOT_LAST_BYTE,
                                                context);

            if((CY_SMIF_SUCCESS == status) && (CY_SMIF_NO_COMMAND_OR_MODE != cmdRead->mode))
            {
                status = Cy_SMIF_TransmitCommand(base,
                                                    (uint8_t)cmdRead->mode,
                                                    cmdRead->modeWidth,
                                                    NULL,
                                                    CY_SMIF_CMD_WITHOUT_PARAM,
                                                    CY_SMIF_WIDTH_NA,
                                                    memConfig->slaveSelect,
                                                    CY_SMIF_TX_NOT_LAST_BYTE,
                                                    context);
            }

            if((CY_SMIF_SUCCESS == status) && (0U < cmdRead->dummyCycles))
            {
                status = Cy_SMIF_SendDummyCycles(base, cmdRead->dummyCycles);
            }

            if(CY_SMIF_SUCCESS == status)
            {
                    status = Cy_SMIF_ReceiveDataBlocking(base,
                                            rxBuffer,
                                            chunk,
                                            cmdRead->dataWidth,
                                            context);
            }
#endif /* CY_IP_MXSMIF_VERSION */

            if(CY_SMIF_SUCCESS != status)
            {
                break;  
            }
   
            /* Recalculate the next rxBuffer offset */
            length -= chunk;
            address += chunk;
            rxBuffer = (uint8_t *)rxBuffer + chunk;
        }
        /* Restore interrupts */
        if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
        {
             Cy_SysLib_ExitCriticalSection(interruptState);
        }
    }

