RT-Thread/rt-thread/bsp/cypress/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_smif_memslot.c
    return status;
}


/*******************************************************************************
* Function Name: Cy_SMIF_MemEraseSector
****************************************************************************//**
*
* Erases a block/sector of the external memory.
* This is a blocking function, it will block the execution flow until
* the command transmission is completed.
*
* \param base
* Holds the base address of the SMIF block registers.
*
* \param memConfig
* The memory device configuration.
*
* \param address
* The address of the block to be erased. The address should be aligned with 
* the start address of the sector.
*
* \param length
* The size of data to erase. The length should be equal to the sum of all sectors
* length to be erased. Otherwise, API returns \ref CY_SMIF_BAD_PARAM without
* performing erase operation.
*
* \param context
* This is the pointer to the context structure \ref cy_stc_smif_context_t
* allocated by the user. The structure is used during the SMIF
* operation for internal configuration and data retention. The user must not
* modify anything in this structure.
*
* \return The status of the operation. See \ref cy_en_smif_status_t.
*
* \note Memories like hybrid have sectors of different sizes. \n
* Check the adress and length parameters before calling this function.
*
* \funcusage 
* \snippet smif/snippet/main.c snippet_Cy_SMIF_MemEraseSector
*
*******************************************************************************/
cy_en_smif_status_t Cy_SMIF_MemEraseSector(SMIF_Type *base, cy_stc_smif_mem_config_t const *memConfig,
                                           uint32_t address, uint32_t length,
                                           cy_stc_smif_context_t const *context)
{
    cy_en_smif_status_t status = CY_SMIF_SUCCESS;
    uint32_t endAddress = address + length - 1UL;
    uint32_t eraseEnd = 0UL;
    uint32_t hybridRegionStart = 0UL;
    uint8_t addrArray[CY_SMIF_FOUR_BYTES_ADDR] = {0U};
    cy_stc_smif_hybrid_region_info_t* hybrInfo = NULL;
    CY_ASSERT_L1(NULL != memConfig);
    cy_stc_smif_mem_device_cfg_t *device = memConfig->deviceCfg;
    uint32_t eraseSectorSize = device->eraseSize;
    uint32_t maxEraseTime = device->eraseTime;

    /* Check if the address exceeds the memory size */
    if (endAddress < device->memSize)
    {
        /* In case of hybrid memory - update sector size and offset for first sector */
        status = Cy_SMIF_MemLocateHybridRegion(memConfig, &hybrInfo, address);
        if (CY_SMIF_SUCCESS == status)
        {
            hybridRegionStart = hybrInfo->regionAddress;
            eraseSectorSize = hybrInfo->eraseSize;
            eraseEnd = (hybrInfo->sectorsCount * eraseSectorSize) + hybridRegionStart - 1UL;
        }

        /* Check if the length is less than sector size */
        if(length < eraseSectorSize)
        {
            status = CY_SMIF_BAD_PARAM;
        }
    }
    else
    {
        status = CY_SMIF_BAD_PARAM;
    }

    /* Check if the start address and the sector size are aligned */
    if((status != CY_SMIF_BAD_PARAM) && (0UL == ((address - hybridRegionStart) % eraseSectorSize)))
    {
        /* If the memory is hybrid and there is more than one region to
         * erase - update the sector size and offset for the last sector */
        if(endAddress > eraseEnd)
        {
            status = Cy_SMIF_MemLocateHybridRegion(memConfig, &hybrInfo, endAddress);
            if (CY_SMIF_SUCCESS == status)
            {
                hybridRegionStart = hybrInfo->regionAddress;
                eraseSectorSize = hybrInfo->eraseSize;
            }
        }

        /* Check if the end address and the sector size are aligned */
        if((status != CY_SMIF_BAD_PARAM) && (0UL == ((endAddress - hybridRegionStart + 1UL) % eraseSectorSize)))
        {
            uint32_t interruptState = 0UL;

            /* If XIP is enabled, disable interrupts to avoid task switching to a code running in
             * XIP when erase operation is ongoing */
            if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
            {
                interruptState = Cy_SysLib_EnterCriticalSection();
            }

            while(length > 0UL)
            {
                /* In case of hybrid memory - update erase size and time for current region */
                status = Cy_SMIF_MemLocateHybridRegion(memConfig, &hybrInfo, address);
                if (CY_SMIF_SUCCESS == status)
                {
                    maxEraseTime =  hybrInfo->eraseTime;
                    eraseSectorSize = hybrInfo->eraseSize;
                    hybridRegionStart = hybrInfo->regionAddress;
                    eraseEnd = (hybrInfo->sectorsCount * eraseSectorSize) + hybridRegionStart - 1UL;
                    if(endAddress < eraseEnd)
                    {
                        eraseEnd = endAddress;
                    }
                }
                else
                {
                    eraseEnd = endAddress;
                }

                while (address < eraseEnd)
                {
                    /* The Write Enable bit may be cleared by the memory after every successful
                    * operation of write/erase operations. Therefore, it must be set for
                    * every loop.
                    */
                    status = Cy_SMIF_MemCmdWriteEnable(base, memConfig, context);
                    if(CY_SMIF_SUCCESS == status)
                    {
                        ValueToByteArray(address, &addrArray[0], 0UL, device->numOfAddrBytes);

                        /* Send the command to erase one sector */
                        status = Cy_SMIF_MemCmdSectorErase(base, (cy_stc_smif_mem_config_t* )memConfig,
                                                           (const uint8_t *)addrArray, context);
                        if(CY_SMIF_SUCCESS == status)
                        {
                            /* Wait until the erase operation is completed or a timeout occurs.
                             * Note: eraseTime is in milliseconds */
                            status = Cy_SMIF_MemIsReady(base, memConfig, (maxEraseTime * ONE_MILLI_IN_MICRO), context);

                            /* Recalculate the next sector address offset */
                            if(length > eraseSectorSize)
                            {
                                address += eraseSectorSize;
                                length -= eraseSectorSize;
                            }
                            else
                            {
                                length = 0;
                                break;
                            }
                        }
                    }

                    if(CY_SMIF_SUCCESS != status)
                    {
                        break;
                    }
                }
            }

            /* Restore interrupts */
            if (_FLD2VAL(SMIF_CTL_XIP_MODE, SMIF_CTL(base)) != 0U)
            {
                Cy_SysLib_ExitCriticalSection(interruptState);
            }
        }
        else
        {
            /* The end address and the sector size are not aligned */
            status = CY_SMIF_BAD_PARAM;
        }
    }
    else
    {
        /* The start address and the sector size are not aligned */
        status = CY_SMIF_BAD_PARAM;
    }

